       IDENTIFICATION DIVISION.
       PROGRAM-ID.                     ESTRUCTURA.
       AUTHOR.                         AYMARA M FUSARO.
       DATE-WRITTEN.                   04/06/2022.
      * ---------------------------------------------------------------
       ENVIRONMENT DIVISION. 
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. 
       OBJECT-COMPUTER. 

       INPUT-OUTPUT SECTION. 
       FILE-CONTROL.
      * ---------------------------------------------------------------
       DATA DIVISION. 

       FILE SECTION.

       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
      * ---------------------------------------------------------------
       PROCEDURE DIVISION.

       
