       IDENTIFICATION DIVISION.
      *------------------------ 
       PROGRAM-ID.                 ESTRUCTURA-GO-TO.
       AUTHOR.                     AYMARA M FUSARO.
       DATE-WRITTEN.               17/06/2022.
      * ---------------------------------------------------------------
       PROCEDURE DIVISION.
      *-------------------- 
           GO TO 010-FINAL.

      * ---------------------------------------------------------------
      *    GO TO:
      *     LO QUE HACE ES IR HACIA UNA RUTINA QUE LE ESPECIFIQUEMOS
      *          GO TO <NOMBRE-RUTINA> 