       IDENTIFICATION DIVISION.
      *------------------------ 
       PROGRAM-ID.                 ESTRUCTURA-CLOSE.
       AUTHOR.                     AYMARA M FUSARO.
       DATE-WRITTEN.               17/06/2022.
      * ---------------------------------------------------------------
       PROCEDURE DIVISION.
      *-------------------- 
           CLOSE ARCHIVO-EMPLEADOS.

      * ---------------------------------------------------------------
      *    - CLOSE:
      *     SE UTLIZA PARA CERRAR EL ARCHIVO COBOL

      *    CLOSE <NOMBRE-ARCHIVO>

      *    <NOMBRE-ARCHIVO>:
      *     LO DEFINIMOS EN LA CLAUSULA SELECT Y EN LA FD
