       IDENTIFICATION DIVISION.
      *------------------------ 
       PROGRAM-ID.                 ESTRUCTURA-GOBACK-STOPRUN.
       AUTHOR.                     AYMARA M FUSARO.
       DATE-WRITTEN.               17/06/2022.
      * ---------------------------------------------------------------
       PROCEDURE DIVISION.
      *-------------------- 


      * ---------------------------------------------------------------
      *    - GOBACK / STOP RUN:
      *     LO QUE HACEN ESTAS INSTRUCCIONES ES PARAR EL PROGRAMA EN EL
      *     LUGAR DONDE SE CODIFIQUEN PARA CEDER EL CONTROL AL SISTEMA 
      *     O AL PROGRAMA QUE LO HAYA INVOCADO